podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PDB0_MKE16F16.svd.xml
<!--
Devices using this peripheral: 
      MKE14F16
      MKE16F16
      MKE18F16
-->
      <peripheral>
         <?sourceFile "PDB0_MKE16F16" ?>
         <name>PDB0</name>
         <description>Programmable Delay Block</description>
         <groupName>PDB</groupName>
         <prependToName>PDB0_</prependToName>
         <headerStructName>PDB0</headerStructName>
         <baseAddress>0x40036000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x60</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x150</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x190</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SC</name>
               <description>Status and Control register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>LDOK</name>
                     <description>Load OK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>Continuous Mode Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB operation in One-Shot mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB operation in Continuous mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MULT</name>
                     <description>Multiplication Factor Select for Prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Multiplication factor is 1</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Multiplication factor is 10</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Multiplication factor is 20</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Multiplication factor is 40</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDBIE</name>
                     <description>PDB Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDBIF</name>
                     <description>PDB Interrupt Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDBEN</name>
                     <description>PDB Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB disabled. Counter is off</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSEL</name>
                     <description>Trigger Input Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Trigger-In 0 is selected</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Trigger-In 1 is selected</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Trigger-In 2 is selected</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Trigger-In 3 is selected</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Trigger-In 4 is selected</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Trigger-In 5 is selected</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Trigger-In 6 is selected</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Trigger-In 7 is selected</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Trigger-In 8 is selected</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Trigger-In 9 is selected</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Trigger-In 10 is selected</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Trigger-In 11 is selected</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Trigger-In 12 is selected</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Trigger-In 13 is selected</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Trigger-In 14 is selected</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Software trigger is selected</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRESCALER</name>
                     <description>Prescaler Divider Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Counting uses the peripheral clock divided by multiplication factor selected by MULT</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Counting uses the peripheral clock divided by twice of the multiplication factor selected by MULT</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Counting uses the peripheral clock divided by four times of the multiplication factor selected by MULT</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Counting uses the peripheral clock divided by eight times of the multiplication factor selected by MULT</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Counting uses the peripheral clock divided by 16 times of the multiplication factor selected by MULT</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Counting uses the peripheral clock divided by 32 times of the multiplication factor selected by MULT</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Counting uses the peripheral clock divided by 64 times of the multiplication factor selected by MULT</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Counting uses the peripheral clock divided by 128 times of the multiplication factor selected by MULT</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWTRIG</name>
                     <description>Software Trigger</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>PDBEIE</name>
                     <description>PDB Sequence Error Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB sequence error interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB sequence error interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LDMOD</name>
                     <description>Load Mode Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>The internal registers are loaded with the values from their buffers immediately after 1 is written to LDOK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>The internal registers are loaded with the values from their buffers when the PDB counter reaches the MOD register value after 1 is written to LDOK</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>The internal registers are loaded with the values from their buffers when a trigger input event is detected after 1 is written to LDOK</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>The internal registers are loaded with the values from their buffers when either the PDB counter reaches the MOD register value or a trigger input event is detected, after 1 is written to LDOK</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD</name>
               <description>Modulus register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>MOD</name>
                     <description>PDB Modulus</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>Counter register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>PDB Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDLY</name>
               <description>Interrupt Delay register</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>IDLY</name>
                     <description>PDB Interrupt Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>2</dim>
               <dimIncrement>40</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>CH,@pCH@i@f</name>
               <addressOffset>0x10</addressOffset>
               <register>
                  <name>C1</name>
                  <description>Channel n Control register 1</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>EN</name>
                        <description>PDB Channel Pre-Trigger Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>PDB channel&apos;s corresponding pre-trigger disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>PDB channel&apos;s corresponding pre-trigger enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TOS</name>
                        <description>PDB Channel Pre-Trigger Output Select</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>PDB channel&apos;s corresponding pre-trigger is in bypassed mode. The pre-trigger asserts one peripheral clock cycle after a rising edge is detected on selected trigger input source or software trigger is selected and SWTRIG is written with 1</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>PDB channel&apos;s corresponding pre-trigger asserts when the counter reaches the channel delay register and one peripheral clock cycle after a rising edge is detected on selected trigger input source or software trigger is selected and SETRIG is written with 1</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BB</name>
                        <description>PDB Channel Pre-Trigger Back-to-Back Operation Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>PDB channel&apos;s corresponding pre-trigger back-to-back operation disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>PDB channel&apos;s corresponding pre-trigger back-to-back operation enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
