podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PDB0_MKE16F16.svd.xml
               <register>
                  <name>S</name>
                  <description>Channel n Status register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>ERR</name>
                        <description>PDB Channel Sequence Error Flags</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Sequence error not detected on PDB channel&apos;s corresponding pre-trigger</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Sequence error detected on PDB channel&apos;s corresponding pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from PDB channel n. When one conversion, which is triggered by one of the pre-triggers from PDB channel n, is in progress, new trigger from PDB channel&apos;s corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is set. Writing 0&apos;s to clear the sequence error flags</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CF</name>
                        <description>PDB Channel Flags</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>8</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
                  <name>DLY%s</name>
                  <description>Channel n Delay %s register</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DLY</name>
                        <description>PDB Channel Delay</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>DACINTC</name>
               <description>DAC Interval Trigger n Control register</description>
               <addressOffset>0x150</addressOffset>
               <fields>
                  <field>
                     <name>TOE</name>
                     <description>DAC Interval Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DAC interval trigger disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DAC interval trigger enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>DAC External Trigger Input Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DAC external trigger input disabled. DAC interval counter is reset and started counting when a rising edge is detected on selected trigger input source or software trigger is selected and SWTRIG is written with 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DAC external trigger input enabled. DAC interval counter is bypassed and DAC external trigger input triggers the DAC interval trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACINT</name>
               <description>DAC Interval n register</description>
               <addressOffset>0x154</addressOffset>
               <fields>
                  <field>
                     <name>INT</name>
                     <description>DAC Interval</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POEN</name>
               <description>Pulse-Out n Enable register</description>
               <addressOffset>0x190</addressOffset>
               <fields>
                  <field>
                     <name>POEN</name>
                     <description>PDB Pulse-Out Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB Pulse-Out disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB Pulse-Out enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PODLY</name>
               <description>Pulse-Out n Delay register</description>
               <addressOffset>0x194</addressOffset>
               <fields>
                  <field>
                     <name>DLY2</name>
                     <description>PDB Pulse-Out Delay 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DLY1</name>
                     <description>PDB Pulse-Out Delay 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
